In [1]:
import pandas as pd
import numpy as np
import seaborn as sns

In [2]:
td = pd.read_csv('tourism_data.csv')
td.head()

,Continent,Country,CountryJoin,Month,Seasons,State,Way In,Year,Count,GDP,Population
0,Europe,Austria,Austria,January,Winter,Amazonas,Land,2009,4.0,30000.0,8192880.0
1,Europe,Denmark,Denmark,January,Winter,Amazonas,Land,2009,2.0,31100.0,5450661.0
2,Europe,Switzerland,Switzerland,January,Winter,Amazonas,Land,2009,15.0,32700.0,7523934.0
3,Europe,Norway,Norway,January,Winter,Amazonas,Land,2009,0.0,37800.0,4610820.0
4,Europe,Other countries,NaN,January,Winter,Mato Grosso do Sul,Land,2009,0.0,NaN,NaN

In [3]:
td.shape

(247284, 11)

In [4]:
td.tail(10)

,Continent,Country,CountryJoin,Month,Seasons,State,Way In,Year,Count,GDP,Population
247274,Europe,Denmark,Denmark,May,Spring,Rio Grande do Sul,River,2011,0.0,31100.0,5450661.0
247275,Europe,Switzerland,Switzerland,May,Spring,Rio Grande do Sul,River,2011,0.0,32700.0,7523934.0
247276,Europe,Norway,Norway,May,Spring,Rio Grande do Sul,River,2011,0.0,37800.0,4610820.0
247277,Europe,Other countries,NaN,August,Summer,Acre,River,2015,0.0,NaN,NaN
247278,Europe,Russia,Russia,August,Summer,Acre,River,2015,0.0,8900.0,142893540.0
247279,Europe,Poland,Poland,August,Summer,Acre,River,2015,0.0,11100.0,38536869.0
247280,Europe,Hungary,Hungary,August,Summer,Acre,River,2015,0.0,13900.0,9981334.0
247281,Europe,Czech Republic,Czech Republic,August,Summer,Acre,River,2015,0.0,15700.0,10235455.0
247282,Europe,Portugal,Portugal,August,Summer,Acre,River,2015,0.0,18000.0,10605870.0
247283,Europe,Greece,Greece,August,Summer,Acre,River,2015,0.0,20000.0,10688058.0

In [5]:
td.describe()

                Year          Count            GDP    Population
count  247284.000000  245364.000000  214848.000000  2.148480e+05
mean     2010.249478     244.807841   16518.984584  7.998275e+07
std         3.206390    2140.069391   11310.097391  2.340447e+08
min      2005.000000       0.000000     900.000000  1.995090e+05
25%      2007.000000       0.000000    5100.000000  6.352117e+06
50%      2010.000000       0.000000   13900.000000  1.212707e+07
75%      2013.000000      12.000000   27700.000000  4.359304e+07
max      2015.000000  353122.000000   37800.000000  1.313974e+09

In [6]:
td.columns

Index(['Continent', 'Country', 'CountryJoin', 'Month', 'Seasons', 'State',
       'Way In', 'Year', 'Count', 'GDP', 'Population'],
      dtype='object')

In [7]:
td.nunique()

Continent         7
Country          54
CountryJoin      50
Month            12
Seasons           4
State            18
Way In            4
Year             11
Count          6179
GDP              46
Population       50
dtype: int64

In [8]:
td.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 247284 entries, 0 to 247283
Data columns (total 11 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   Continent    247284 non-null  object
 1   Country      247284 non-null  object
 2   CountryJoin  214848 non-null  object
 3   Month        247284 non-null  object
 4   Seasons      247284 non-null  object
 5   State        247284 non-null  object
 6   Way In       247284 non-null  object
 7   Year         247284 non-null  int64
 8   Count        245364 non-null  float64
 9   GDP          214848 non-null  float64
 10  Population   214848 non-null  float64
dtypes: float64(3), int64(1), object(7)
memory usage: 20.8+ MB

In [9]:
td.isnull().sum()

Continent          0
Country            0
CountryJoin    32436
Month              0
Seasons            0
State              0
Way In             0
Year               0
Count           1920
GDP            32436
Population     32436
dtype: int64

In [10]:
td['GDP'] = td['GDP'].fillna(td['GDP'].mean())
td['Population'] = td['Population'].fillna(td['Population'].mean())

In [11]:
td['Country'] = td['Country'].fillna(td['Country'].mode()[0])
td['State'] = td['State'].fillna(td['State'].mode()[0])

In [12]:
td.isnull().sum()

Continent          0
Country            0
CountryJoin    32436
Month              0
Seasons            0
State              0
Way In             0
Year               0
Count           1920
GDP                0
Population         0
dtype: int64

In [13]:
td['CountryJoin'] = td['CountryJoin'].fillna('Other countries')

In [14]:
td['CountryJoin'].isnull().sum()

0

In [15]:
td.isnull().sum()

Continent         0
Country           0
CountryJoin       0
Month             0
Seasons           0
State             0
Way In            0
Year              0
Count          1920
GDP               0
Population        0
dtype: int64

In [17]:
average_count = td['Count'].mean()
td['Count'] = td['Count'].fillna(average_count)

In [18]:
td.isnull().sum()

Continent      0
Country        0
CountryJoin    0
Month          0
Seasons        0
State          0
Way In         0
Year           0
Count          0
GDP            0
Population     0
dtype: int64

In [ ]:
t.to_csv(cleaned_file_path, index=False)